#Вариант 14

# №2
# Даны 3 целых числа. Найти среднее из них (то есть число, расположенное между наименьшим и наибольшим)

while True:
    # Ввод чисел и обработка исключений
    try:
        A, B, C = int(input("Введите 1 число A: ")), int(input("Введите 2 число B: ")), int(input("Введите 3 число C: "))
    except ValueError:
        print("Возникла ошибка")
        continue

    # Ищем медианное число
    if A <= B <= C or C <= B <= A: x = B
    elif B <= A <= C or C <= A <= B: x = A
    else: x = C

    print("Среднее число: ", x, "\n")