#Вариант 14

# №1
# Даны 3 целых числа: A, B, C. Проверить истинность высказывания: "Каждое из чисел A, B, C - положительное."
while True:
    # Ввод чисел и обработка исключений
    try:
        A = int(input("Введите 1 число A: "))
        B = int(input("Введите 2 число B: "))
        C = int(input("Введите 3 число C: "))
    except ValueError:
        print("Возникла ошибка")

    # Проверка высказывания
    if A > 0 and B > 0 and C > 0: print("Высказывание истинно! \n")
    else: print("Высказывание ложно! \n")
        
