# Вариант 14

# №1
# Дано вещественное число A и целое число N (>0). Используя один цикл, вывести все целые степени числа A от 1 до N.
while True:
    # Ввод числа и обработка исключений
    try:
        A = float(input("Введите вещественное число A: "))
        N = int(input("Введите целое число N (>0): "))
        if N <= 0:
            print("N должно быть больше 0. Попробуйте снова.")
            continue
    except ValueError:
        print("Возникла ошибка, попробуйте снова")
        continue

    # Вывод степеней числа A от 1 до N
    i = 1
    while i < N:
        print(f"{A}^{i} = {A ** i}")
        i+=1