# Вариант 14

# №2
# Дано целое число N(>0). Найти наименьшее целое положительное число K, квадрат которого превосходит N: K^2 > N. Функцию извлечения квадратного корня не использовать.
while True:
    # Ввод числа и обработка исключений
    try:
        N = int(input("Введите целое число N (>0): "))
        if N <= 0:
            print("N должно быть больше 0. Попробуйте снова.")
            continue
    except ValueError:
        print("Возникла ошибка, попробуйте снова")
        continue

    # Поиск наименьшего K, квадрат которого превосходит N
    K = 1
    while K * K <= N:
        K += 1

    print(f"Наименьшее целое положительное число K, квадрат которого превосходит {N}: {K}       ({K*K})\n" )