#Дано трехзначное число. Испольуя одну операцию деления нацело, вывести первую цифру данного числа (сотни).

#Бесконечный цикл для повторного ввода числа в случае ошибки
while True:
    
    #Попытка выполнить код
    try:
        #Ввод числа
        word = int(input("Введите трехзначное число: "))
        #Проверка на трехзначность
        if word < 100 or word > 999:
            print("Отказано. Введите трехзначное число.")
        else:
            #Делим нацело на 100
            hundreds = word // 100
            print("Первая цифра (сотни):", hundreds)

    #Обработка исключений
    except:
        print("Что-то пошло не так, попробуйте снова.")
